run/tutorials/case4_structureDyMFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    seabedFoundation
    {
        type            splitCyclic;
    }

    foundationSeabed
    {
        type            splitCyclic;
    }

    seaBed
    {
        type            tractionDisplacementSF;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }


    "left|right"
    {
        type            splitCyclic;
    }

    soilDomainBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontBack
    {
        type            empty;
    }
    /*liq
    {

        patchType       splitCyclic;
        type            cyclicFixedValue;
        value           uniform (0 0 0 );
        //type            splitCyclic;
    }

    sol
    {
        patchType       splitCyclic;
        type            tractionPressureDisplacementSF;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }*/

    liq
    {
        type            splitCyclic;
    }
    sol
    {
        type            splitCyclic;
    }
}

// ************************************************************************* //
